{
  "spawnpoint": {
    "name": "Spawnpoint",
    "neededToEnter": [],
    "neighbors": {
      "north": "town",
      "south": "tundra",
      "east": "trail",
      "west": "cliffside"
    },
    "neededAlliances": [],
    "bannedAlliances": [],
    "availableAlliances": [],
    "npcs": {
      "girl": {
        "name": "Amelia",
        "text": "\"Hey there! My name's Amelia! I see you're another newcomer, if you want to find anyone else, I'd advise that you go check out the town up north, or the Birdwatch Fort to the east. Speaking of Birdwatch, if you'd like to know anything more about them, I would tell you to head over to the Birdwatch Diner, it's just north of the town. Oh! If you ever need to be healed, I've heard there's a magic fountain around here somewhere... It's a dangerous world out there. See ya!\"",
        "wares": {}
      },
      "guard": {
        "name": "Birdwatch Guard",
        "text": "\"Protect and serve... Gotta make sure that everything is safe for the newcomers, ever since the war started, we've been in the crossfire, seeing as the opposing sides are directly south and west of here...\"",
        "wares": {}
      }
    },
    "items": {},
    "enemies": {},
    "text": "You arrive at the world spawnpoint. It's a well-forested area, and the ground is scattered with rocks and leaves. On a particularly large boulder, a little girl is sitting and looking at the trees, (\"talk girl\") and by the entrance to a trail stands a guard. (\"talk guard\") To the north, you see a small town area, and to the east you see a dirt trail leading into the trees. To the south, you see a snowy area to which a trail of small, tri-pointed tracks lead. To the west, you see a soaring cliff flocked by pigeons."
  },
  "tundra": {
    "name": "Tundra",
    "neededToEnter": [],
    "neighbors": {
      "north": "spawnpoint",
      "south": "snowyTrail",
      "west": "fountain"
    },
    "neededAlliances": [],
    "bannedAlliances": [],
    "availableAlliances": [],
    "npcs": {},
    "items": {},
    "enemies": {},
    "text": "You walk to the precipice of the snow. The change in temperature is immediate and unnatural, you know you can't pass without some form of higher insulation. Farther to the south, sat in the middle of the snow is an odd building surrounded by unidenifiable figures. Back to the north, you can see the spawnpoint, and to the west, you see a fountain."
  },
  "snowyTrail": {
    "name": "Snowy Trail",
    "neededToEnter": ["Coat"],
    "neighbors": {
      "north": "tundra",
      "south": "penguinBase"
    },
    "neededAlliances": [],
    "bannedAlliances": [],
    "availableAlliances": [],
    "npcs": {},
    "items": {},
    "enemies": {},
    "text": "You walk along a snow-covered trail. To the north is the tundra, and to the south is a fort surrounded by small, armed figures. Even though they are clearly protecting the fort, they seem docile enough to let you enter as long as you're friendly."
  },
  "penguinBase": {
    "name": "Penguin Base",
    "neededToEnter": ["Coat"],
    "neighbors": {
      "north": "snowyTrail",
      "south": "penguinHQ",
      "west": "penguinArmory"
    },
    "neededAlliances": [],
    "bannedAlliances": ["pigeon"],
    "availableAlliances": ["penguin"],
    "npcs": {
      "commander": {
        "name": "Penguin Commander",
        "text": "\"Welcome to the penguin army headquarters! Here we have some of the most technologically advanced weaponry, armor, and other items, as well as some other top secret assets and services that I can't tell you about because they're top secret. Did I mention that? They're top secret. The only way you can know about and use our resources is by allying yourself to the penguins! (\"ally penguin\") Be warned, though, once you ally with us, you won't be able to go back, and you'll never be able to ally yourself with our enemies...\"",
        "wares": {}
      }
    },
    "items": {},
    "enemies": {},
    "text": "You enter the main area of the base, and it's filled with penguins busily running from one task to the next. They're working at desks with computers, training small regiments, arming and building weapons, and planning on war boards. In the middle of the commotion stands a penguin wearing a healment and holding a clipboard and pen. (\"talk commander\") To the west is a building labeled \"armory\", and to the south a building that seems to be the Penguin Headquarters. To the north is the snowy trail you entered on."
  },
  "penguinArmory": {
    "name": "Penguin Armory",
    "neededToEnter": ["Coat"],
    "neighbors": {
      "east": "penguinBase"
    },
    "neededAlliances": ["penguin"],
    "bannedAlliances": ["pigeon"],
    "availableAlliances": [],
    "npcs": {
      "clerk": {
        "name": "Penguin Clerk",
        "text": "\"Welcome the armory, here you can get kitted up for official battles, or for personal expeditions.\"\nWares:\n\nPorter - $750\nSupplements - $1500\nRPG - $1000\n\n(Use \"inspect {item}\" or \"buy {item}\")",
        "wares": {
          "porter": {
            "name": "Porter",
            "price": 750,
            "type": "other",
            "description": "Allows you to use the \"spawn\" command to teleport back to the world spawn."
          },
          "supplements": {
            "name": "Supplements",
            "price": 1500,
            "type": "other",
            "description": "Allows you to train 10% faster and 25% harder! "
          },
          "rpg": {
            "name": "RPG",
            "price": 1000,
            "type": "weapon",
            "damage": 20,
            "description": "A rocket-propelled grenade launcher developed by the penguin army. 20 attack damage. (Would probably be more if it wasn't sized for a three foot tall penguin)"
          }
        }
      }
    },
    "items": {},
    "enemies": {},
    "text": "You enter the armory, and see a penguin standing behind a desk and in front of a wall mounted with equipment. (\"talk clerk\")"
  },
  "penguinHQ": {
    "name": "Penguin Headquarters",
    "neededToEnter": [],
    "neighbors": {
      "north": "penguinBase"
    },
    "neededAlliances": ["penguin"],
    "bannedAlliances": ["pigeon"],
    "availableAlliances": [],
    "npcs": {
      "commander": {
        "name": "Penguin Commander",
        "text": "\"Welcome to the Penguin Headquarters! Here, we plan and execute raids on the Pigeon Base. You can participate if you are at least level 5. Raids are a great way to support the team by driving up the win rate, which will grant you a higher daily reward at the courtyard! Also, raiding is a good way to get XP. (\"raid\")\"",
        "wares": {}
      }
    },
    "items": {},
    "enemies": {},
    "text": "You enter the penguin HQ. Inside is a large room with no windows, and a table with a monitor displaying a map for a surface. The map seems to display the Penguin and Pigeon bases. Next to it stands the Penguin Commander. (\"talk commander\") To the north is the Penguin Base."
  },
  "cliffside": {
    "name": "Cliffside",
    "neededToEnter": [],
    "neighbors": {
      "north": "mine",
      "east": "spawnpoint",
      "south": "fountain",
      "west": "rockyTrail"
    },
    "neededAlliances": [],
    "bannedAlliances": [],
    "availableAlliances": [],
    "npcs": {},
    "items": {},
    "enemies": {},
    "text": "You walk to the bottom of the cliff. It soars higher now than you could have noticed before; easily over a hundred feet up. The pigeons look at you tauntingly, but you know you will require more than your bare hands to scale the cliff. Farther to the west, on top of the cliff, you see a strange building. Back to the east, you can see the spawnpoint, to the south, you see a fountain, and to the north, you can see what looks like a mineshaft."
  },
  "fountain": {
    "name": "Glowing Fountain",
    "neededToEnter": [],
    "neighbors": {
      "north": "cliffside",
      "east": "tundra"
    },
    "neededAlliances": [],
    "bannedAlliances": [],
    "availableAlliances": [],
    "npcs": {
      "squirrel": {
        "name": "Bizarre Squirrel",
        "text": "[The squirrel doesn't speak, of course, but you look into its eyes and understand the IT is the source of healing the people speak of, and it will heal you too, for a price. (\"heal\")]",
        "wares": {}
      }
    },
    "items": {},
    "enemies": {},
    "text": "You walk into an opening in the trees and in the middle is a hill with a gorgeous marble fountain atop it. It looks centuries old, but has somehow remained untarnished, despite being in the only exposed spot in the forest. You immediately understand that it must be magic, to be so beautiful in the face of adveristy. At that very moment, an unusually large squirrel crawls around the side of the fountain and looks at you. It has an exeptionally long tounge, a queer grin, and an equally odd gaze. (\"talk squirrel\") To the north, you can see the cliffside, and to the east, you can make out the tundra."
  },
  "rockyTrail": {
    "name": "Rocky Trail",
    "neededToEnter": ["Rope"],
    "neighbors": {
      "east": "cliffside",
      "west": "pigeonBase"
    },
    "neededAlliances": [],
    "bannedAlliances": [],
    "availableAlliances": [],
    "npcs": {},
    "items": {},
    "enemies": {},
    "text": "You come to a rocky gravel trail on top of the cliff. To the east is the cliffside you climbed to get here, and to the west is a building covered in pigeons."
  },
  "pigeonBase": {
    "name": "Pigeon Base",
    "neededToEnter": [],
    "neighbors": {
      "north": "pigeonHQ",
      "east": "rockyTrail",
      "west": "pigeonHall"
    },
    "neededAlliances": [],
    "bannedAlliances": ["penguin"],
    "availableAlliances": ["pigeon"],
    "npcs": {},
    "items": {},
    "enemies": {},
    "text": "The pigeons' base is a towering gothic building made of marble. The door is a massive archway, and inside the building is a hall filled with pigeons seated far above you on the various ledges dotting the walls. On a wall near the entrance, there is a pigeon propaganda poster that says to join the pigeon army. (\"ally pigeon\") To the west is a grand hall, to the north is what looks to be the Pigeon Headquarters, and to the east is the trail you came on."
  },
  "pigeonHall": {
    "name": "Pigeon Hall",
    "neededToEnter": [],
    "neighbors": {
      "east": "pigeonBase"
    },
    "neededAlliances": ["pigeon"],
    "bannedAlliances": ["penguin"],
    "availableAlliances": [],
    "npcs": {
      "computer": {
        "name": "Penguin Computer",
        "text": "[The computer navigates to a small shop page.]\nWares:\n\nCompanion - $2000\nKunai - $1000\n\n(Use \"inspect {item}\" or \"buy {item}\")",
        "wares": {
          "companion": {
            "name": "Companion",
            "price": 2000,
            "type": "other",
            "description": "A robotic pigeon companion. Flies behind you, always watching. Prevents you from losing money on death, and gives a 10% discount on all purchasable items (Includes training fee and online battle losses, and will be applied AFTER purchase)"
          },
          "kunai": {
            "name": "Kunai",
            "price": 1000,
            "type": "weapon",
            "damage": 30,
            "description": "A sleek, tapered knife with a case that slides over top perfectly. Masterfully crafted, anodized matte black. Deals 20 damage."
          },
          "birdseed": {
            "name": "Birdseed",
            "price": 5,
            "type": "food",
            "description": "A cup of birdseed, yum. Heals 10HP. (\"eat birdseed\")"
          }
        }
      }
    },
    "items": {},
    "enemies": {},
    "text": "In the middle of the otherwise empty hall is a pedestal with a computer monitor on top of it. The monitor is connected to its source by a multitude of snaking cables of varying thickness and color, all leading outwards towards the walls. The screen is red with a single eye in the middle, flitting about nervously until it notices you and the screen goes black. Without the light of the monitor, you can only see enough to walk up to it (\"talk computer\") or turn around. Back to the east is the entrance to the hall."
  },
  "pigeonHQ": {
    "name": "Pigeon Headquarters",
    "neededToEnter": [],
    "neighbors": {
      "south": "pigeonBase"
    },
    "neededAlliances": ["pigeon"],
    "bannedAlliances": ["penguin"],
    "availableAlliances": [],
    "npcs": {
      "manager": {
        "name": "Pigeon Manager",
        "text": "\"Welcome to the Pigeon Headquarters, where we launch raids on the hated penguins. If you're level 5 or higher, you can participate. Raids are a great way to support the team by driving up the win rate, which will grant you a higher daily reward at the courtyard, and raiding is also a good way to get XP. (\"raid\")\"",
        "wares": {}
      }
    },
    "items": {},
    "enemies": {},
    "text": "You enter the Headquarters. It is a dark room filled with pigeons monitoring old terminal screens, each displaying a different view of the Penguin Base. In the middle of the room, on a stool, is a pigeon who seems to be in charge. (\"talk manager\") To the south is the Pigeon Base."
  },
  "town": {
    "name": "Town Center",
    "neededToEnter": [],
    "neighbors": {
      "north": "diner",
      "east": "courtyard",
      "south": "spawnpoint",
      "west": "mine"
    },
    "neededAlliances": [],
    "bannedAlliances": [],
    "availableAlliances": [],
    "npcs": {
      "merchant": {
        "name": "Strange Merchant",
        "text": "\"Welcome to my shoppe! Here you can purchase from my endless stock of seemingly random products, ha!\"\nWares:\n\nSuperPick - $1000\nDagger - $250\nQuickShoes - $750\nMap - $500\n\n(Use \"inspect {item}\" or \"buy {item}\")",
        "wares": {
          "superpick": {
            "name": "SuperPick",
            "price": 1000,
            "type": "other",
            "description": "The newest SuperPick model, even though it's not yet released? Grants 35% faster mining speed."
          },
          "map": {
            "name": "Map",
            "price": 500,
            "type": "other",
            "description": "A dusty map. Gives you a small map on your UI."
          },
          "dagger": {
            "name": "Dagger",
            "price": 250,
            "type": "weapon",
            "damage": 5,
            "description": "A small, shiny dagger. Increases attack damage by 5."
          },
          "quickshoes": {
            "name": "QuickShoes",
            "price": 750,
            "type": "speed",
            "speed": 2,
            "description": "Neon pink tennis shoes, ugly but effective. Grants +2 speed."
          }
        }
      },
      "governor": {
        "name": "Governor Thompson",
        "text": "\"Hello there! I'm the Governor of prospect town, named for its abundance in gold, and more importantly, prospectors! (Of course, we haven't had much busniness since the great bird war started.) The Birdwatch has taken pretty good care of us, but I'm not as fond of them as the people in the Diner to the north. Their obesession with the Birdwatch has become something of an... Oh-- well, never mind that.\"",
        "wares": {}
      },
      "prospector": {
        "name": "Gold Prospector",
        "text": "\"Well howdy, kid. If yer lookin' to make a few dimes, I'd suggest you head on over to the gold mines. It don't pay all that well, but I reckon it's better than any other job that silly governor will put you up to.\"",
        "wares": {}
      }
    },
    "items": {},
    "enemies": {},
    "text": "You walk to the center of the town and look around. In a corner stands a skinny man with strange eyes and a small table of wares, attached to which is a sign that proclaims it to be a \"Shoppe\". (\"talk merchant\") In the center of the square, a man in a tweed suit and tophat is standing by himself. (\"talk governor\") Back to the south, you can see the spawnpoint, and to the north is a building with a red and white awning, with a sign labeled \"BW's Diner\".To the west, you see what looks like a mineshaft. A man with a pickaxe and candle with a reflector strapped to his forehead is standing by the entrance trail to the mineshaft. (\"talk prospector\")"
  },
  "diner": {
    "name": "Birdwatch Diner",
    "neededToEnter": ["Coupon"],
    "neighbors": {
      "north": "arena",
      "east": "prestigeHall",
      "south": "town"
    },
    "neededAlliances": [],
    "bannedAlliances": [],
    "availableAlliances": [],
    "npcs": {
      "dealer": {
        "name": "Blackjack Dealer",
        "text": "\"Hey. If ya'd like ta play blackjack, ya can use tha \"blackjack {bet}\" command. If ya need an explanation, type \"blackjack help\".\"",
        "wares": {}
      },
      "bouncer": {
        "name": "Bouncer",
        "text": "\"If you vant to get in, you vill need an invitation.\"",
        "wares": {}
      },
      "man": {
        "name": "Retired Birdwatch Guard",
        "text": "\"Hey. I've seen you new folks roamin' around spawn, but you're the first I seen in here. Hopefully you're wantin' to investigate them pigeons? If ya'd like, I can sell you my old climbing rope for a few bucks, so ya can get up to their sanctuary on top of that old cliff. A warnin', though: Both sides of the war are no good. Don't get any ideas of conspirin' with any of them shady bunch.\"\nWares:\n\nRope - $50\n\n(Use \"inspect {item}\" or \"buy {item}\")",
        "wares": {
          "rope": {
            "name": "Rope",
            "price": 50,
            "type": "other",
            "description": "Birdwatch standard issue. Old, but strong enough."
          }
        }
      },
      "cook": {
        "name": "Cook",
        "text": "\"How're you doing? I've been the cook here for awhile, gotta keep our troops strong. What can I get for you?\"\nWares:\n\nSandwich - $20\nCake - $200\n\n(Use \"inspect {item}\" or \"buy {item}\")",
        "wares": {
          "sandwich": {
            "name": "Sandwich",
            "price": 20,
            "type": "food",
            "description": "An absolutely massive chicken sandwich. (looks like it used the entire thing) Eat the birds, beat the birds, I guess. Heals 50 HP. (\"eat sandwich\")"
          },
          "cake": {
            "name": "Cake",
            "price": 200,
            "type": "food",
            "description": "What appears to be an entire wedding cake. Heals a whopping 200HP. (\"eat cake\")"
          }
        }
      }
    },
    "items": {},
    "enemies": {},
    "text": "You enter the Diner, and notice there are only a few people present, fewer of them eating. One man sits alone at a table with a drink in hand. He looks older, probably in his late fifties. (\"talk man\") There's only one cook, standing bored behind the counter, waiting for business. (\"talk cook\") Playing blackjack with a few tired, and progressively poorer patrons, is a dealer. (\"talk dealer\") On the northern wall, there's a door with a bouncer guarding it. (\"talk bouncer\") Back to the south is the town, and to the east is a large marble hall."
  },
  "arena": {
    "name": "Illicit Arena",
    "neededToEnter": ["Invitation"],
    "neighbors": {
      "south": "diner"
    },
    "neededAlliances": [],
    "bannedAlliances": [],
    "availableAlliances": [],
    "npcs": {
      "bookie": {
        "name": "Bookie",
        "text": "\"If you want to fight someone, just use the \"battle {buff}\" command to be added to the queue to fight another player! You can choose a buff of attack, speed, or defense that will be temporarily applied to your stats to give you and edge over your opponent. The winner will receive 10% of the loser's money, and we'll get you back to full health afterwards.\"",
        "wares": {}
      }
    },
    "items": {},
    "enemies": {},
    "text": "The bouncer checks your invitation and lets you through the door with a scowl. The arena consists of a boxing ring surrounded by bleachers and a table with a person waiting to take bets on the side. (\"talk bookie\")"
  },
  "mine": {
    "name": "Gold Mine",
    "neededToEnter": [],
    "neighbors": {
      "east": "town",
      "south": "cliffside"
    },
    "neededAlliances": [],
    "bannedAlliances": [],
    "availableAlliances": [],
    "npcs": {
      "prospector": {
        "name": "Gold Prospector",
        "text": "\"Hey there, welcome to the gold mine! To start mining, use the command \"mine\". You'll find yerself some gold sure 'nuff. If you do, bring it to me and I'll take it off yer hands in exchange fer some dough.\"",
        "wares": {}
      }
    },
    "items": {},
    "enemies": {},
    "text": "You walk into the mine's opening, and find a large interior hewn from the rock. Another prospector stands by a torch on one of the support structures. (\"talk prospector\") Back to the east is the town, and to the south is the cliffside."
  },
  "courtyard": {
    "name": "Courtyard",
    "neededToEnter": [],
    "neighbors": {
      "north": "prestigeHall",
      "east": "forestTrail",
      "south": "trail",
      "west": "town"
    },
    "neededAlliances": [],
    "bannedAlliances": [],
    "availableAlliances": [],
    "npcs": {},
    "items": {},
    "enemies": {},
    "text": "You walk into a gorgeous brick courtyard. On a pole, there's a board with various requests and bounties tacked to it, perhaps you can make some money by completing them. (\"quests\") Near to the board is a split flap display with the live raid scores of the Pigeon and Penguin teams. (\"raidreward\") To the north is a majestic marble hall, to the north, a forested trail, to the south, a trail, and to the west, the town square."
  },
  "prestigeHall": {
    "name": "Prestige Hall",
    "neededToEnter": [],
    "neighbors": {
      "east": "forestTrailTwo",
      "south": "courtyard",
      "west": "diner"
    },
    "neededAlliances": [],
    "bannedAlliances": [],
    "availableAlliances": [],
    "npcs": {
      "vituoso": {
        "name": "Birdwatch Virtuoso",
        "text": "You have done well to earn passage into this hall, among the fellow masters of our talent. I offer a unique and precious elixir that will boost your skill in battle with others who have access to this hall.",
        "wares": {
          "elixir": {
            "name": "Elixir",
            "price": 1000000,
            "type": "other",
            "description": "Buying this elixir will give you a 1.5x damage buff and 2x health buff for the next 45 minutes. These buffs only apply to online battles against other players who have access to the prestige hall. (Does not stack.)"
          }
        }
      }
    },
    "items": {},
    "enemies": {},
    "text": "You enter a vast and magnificent marble Romanesque hall. Though you cannot see them, you can sense and communicate with others of equal expertise and experience. At the end of the hall, in an ivory throne sits an old but hardened man. (\"talk virtuoso\") (This location has a private chat that only you and other present players can see.)"
  },
  "trail": {
    "name": "Beaten Trail",
    "neededToEnter": [],
    "neighbors": {
      "north": "courtyard",
      "east": "trailTwo",
      "west": "spawnpoint"
    },
    "neededAlliances": [],
    "bannedAlliances": [],
    "availableAlliances": [],
    "npcs": {},
    "items": {},
    "enemies": {},
    "text": "You walk along the trail. To the west is the spawnpoint, and the trail continues to the east."
  },
  "trailTwo": {
    "name": "Beaten Trail",
    "neededToEnter": [],
    "neighbors": {
      "north": "forestTrail",
      "west": "trail",
      "east": "fort"
    },
    "neededAlliances": [],
    "bannedAlliances": [],
    "availableAlliances": [],
    "npcs": {},
    "items": {},
    "enemies": {
      "bandit": {
        "name": "Bandit",
        "blockedDirection": "east",
        "stats": {
          "health": 80,
          "maxHealth": 80,
          "speed": 2,
          "damage": 15
        }
      }
    },
    "text": "You continue on the trail. It goes on to the east towards a towering fortress, and westward, towards the world spawnpoint. To the north, the trail continues through a more heavily forested area."
  },
  "fort": {
    "name": "Birdwatch Fort",
    "neededToEnter": [],
    "neighbors": {
      "south": "camp",
      "east": "gym",
      "west": "trailTwo"
    },
    "neededAlliances": [],
    "bannedAlliances": [],
    "availableAlliances": [],
    "npcs": {
      "scientist": {
        "name": "Birdwatch Scientist",
        "text": "\"Hello there. I'm the scientist that runs this place, and even if nobody else will admit it, I'm the only reason it's still around... Anything you'd like to purchase?\"\nWares:\n\nCoat - $1500\nSuperDetector - $2000\nArmorplates - $1500\nKatana - $2000\nCoupon - $15\n\n(Use \"inspect {item}\" or \"buy {item}\")",
        "wares": {
          "coat": {
            "name": "Coat",
            "price": 1500,
            "type": "other",
            "description": "A jacket engineered to keep the user at an adjustable temperature in any condition, with science!"
          },
          "superdetector": {
            "name": "SuperDetector",
            "price": 2000,
            "type": "other",
            "description": "A metal detector that helps you find 25% more gold when mining!"
          },
          "armorplates": {
            "name": "Armorplates",
            "price": 1500,
            "type": "armor",
            "defense": 20,
            "description": "A vest with armored plating to better defend yourself in a fight. Grants 20 extra HP."
          },
          "katana": {
            "name": "Katana",
            "price": 2000,
            "type": "weapon",
            "damage": 15,
            "description": "A curved sword built from a metal that is both light and strong. Grants 15 extra damage."
          },
          "coupon": {
            "name": "Coupon",
            "price": 15,
            "type": "other",
            "description": "A coupon for a free meal at the Birdwatch Diner. Maybe the Diner is the key to figure out what's going on..."
          }
        }
      },
      "guard": {
        "name": "Birdwatch Guard",
        "text": "*grunt* \"Five minutes 'till my shift is over... I can't even go to the arena tonight, not with my back the way it is... I guess I could sell you my invitation for a few bucks, how about $1000? What a deal...\"\nWares:\n\nInvitation - $1000\n\n(Use \"inspect {item}\" or \"buy {item}\")",
        "wares": {
          "invitation": {
            "name": "Invitation",
            "price": 1000,
            "type": "other",
            "description": "An invitation to \"The Arena\"."
          }
        }
      }
    },
    "items": {},
    "enemies": {},
    "text": "You walk into the fort, through the opened gates. Even though it looked old outside, it's modern and sleek on the inside. In the middle of the room stands a man next to a few desks covered in computers and other trinkets and gadgets (\"talk scientist\"), and by the entrance is a lone guard. (\"talk guard\") Back to the west, you see the trail you came from, and to the east is a giant building with a running track. To the south is what looks like a training grounds."
  },
  "gym": {
    "name": "Birdwatch Training Gym",
    "neededToEnter": [],
    "neighbors": {
      "west": "fort"
    },
    "neededAlliances": [],
    "bannedAlliances": [],
    "availableAlliances": [],
    "npcs": {
      "trainer": {
        "name": "Trainer",
        "text": "\"Hey there! Welcome to my gym, the only place where you can enhance your skills for a small price and a bit of time. If you'd like to begin training, use the command \"train\". Please note that we do require a small fee of $50...\"",
        "wares": {}
      }
    },
    "items": {},
    "enemies": {},
    "text": "You enter the gym. It's a large open area with plenty of equipment, including weights and stationary bikes. Outisde, there's also an entire running track surrounding the building. An extremely beefy man stands next to a bench press with a protein shake in hand. (\"talk trainer\") Back to the west is the Birdwatch Fort."
  },
  "camp": {
    "name": "Birdwatch Boot Camp",
    "neededToEnter": [],
    "neighbors": {
      "north": "fort"
    },
    "neededAlliances": [],
    "bannedAlliances": [],
    "availableAlliances": [],
    "npcs": {
      "referee": {
        "name": "Referee",
        "text": "\"Welcome to the ring! If you want to make a quick buck, you can use the command \"battle\", every enemy you beat will reward you $75! After beating an enemy, I'll patch you up to be at the health you came here at.\"",
        "wares": {}
      }
    },
    "items": {},
    "enemies": {},
    "text": "You walk through the trees and enter the boot camp. It's a huge obstacle course made of ropes hung between the tall pine trees, over the mud pit that makes up the floor of the area. In the middle is what looks to be a wrestling ring. Next to it stands a referee. (\"talk referee\") Back to the north is the fort."
  },
  "forestTrail": {
    "name": "Forested Trail",
    "neededToEnter": [],
    "neighbors": {
      "north": "forestTrailTwo",
      "south": "trailTwo",
      "west": "courtyard"
    },
    "neededAlliances": [],
    "bannedAlliances": [],
    "availableAlliances": [],
    "npcs": {
      "guard": {
        "name": "Birdwatch Guard",
        "text": "\"I wouldn't go any farther if I were you, there's a notorious bandit nest farther up north...\"",
        "wares": {}
      }
    },
    "items": {},
    "enemies": {},
    "text": "You continue along the trail. A guard stands by the trail. (\"talk guard\") To north is the larger trail, and to the south continues the forested path."
  },
  "forestTrailTwo": {
    "name": "Forested Trail",
    "neededToEnter": [],
    "neighbors": {
      "south": "forestTrail",
      "north": "forestTrailThree",
      "west": "prestigeHall"
    },
    "neededAlliances": [],
    "bannedAlliances": [],
    "availableAlliances": [],
    "npcs": {},
    "items": {},
    "enemies": {
      "bandits": {
        "name": "Bandit Gang",
        "blockedDirection": "north",
        "stats": {
          "health": 160,
          "maxHealth": 160,
          "speed": 1,
          "damage": 20
        }
      }
    },
    "text": "You enter a darker part of the trail. The trees are very dense now, and it becomes harder to see where you're going. To the south the trail goes on, to the west is a vast hall, and to the north is the entrance to the trail."
  },
  "forestTrailThree": {
    "name": "Forested Trail",
    "neededToEnter": [],
    "neighbors": {
      "south": "forestTrailTwo",
      "east": "platinumMine",
      "north": "field"
    },
    "neededAlliances": [],
    "bannedAlliances": [],
    "availableAlliances": [],
    "npcs": {},
    "items": {},
    "enemies": {},
    "text": "You continue on the trail, but it begins to brighten. To the west is what looks like another mine, and to the south is the trail that leads back to the world spawnpoint."
  },
  "field": {
    "name": "Sunny Field",
    "neededToEnter": [],
    "neighbors": {
      "south": "forestTrailThree",
      "west": "hollow"
    },
    "neededAlliances": [],
    "bannedAlliances": [],
    "availableAlliances": [],
    "npcs": {},
    "items": {},
    "enemies": {},
    "text": "You walk out of an abrupt ending in the forest and find yourself in an open field of tall grass. Near you is an abandoned cabin with a decaying wooden frame, and at your feet lies a red gasoline canister and a box of matches. Perhaps you can use them for something... To the west is a hollowing in the trees, and to the south is the trail you entered by."
  },
  "hollow": {
    "name": "Nighttime Hollow",
    "neededToEnter": [],
    "neighbors": {
      "east": "field"
    },
    "neededAlliances": [],
    "bannedAlliances": [],
    "availableAlliances": [],
    "npcs": {
      "manny": {
        "name": "Manny",
        "text": "\"Hey bub, happy tommorow eve. What can I get for you?\"\nWares:\n\nMicrowave - $1000\nPouch - $2500\nMine - $500\n\n(Use \"inspect {item}\" or \"buy {item}\")",
        "wares": {
          "microwave": {
            "name": "Microwave",
            "price": 1000,
            "type": "other",
            "description": "A cordless microwave. Adds a x1.5 HP bonus to all the food you eat!"
          },
          "pouch": {
            "name": "Pouch",
            "price": 2500,
            "type": "other",
            "description": "A pouch to store food in. Kind of gross, but allows you to store infinite food. Instead of using \"eat {food}\", use \"eat {amount}\". You can also check how much food you have by using the \"inventory\" command."
          },
          "mine": {
            "name": "Mine",
            "price": 500,
            "type": "weapon",
            "damage": 5,
            "description": "An old naval mine. Defused, but still somewhat useful. Provides 5 extra damage."
          }
        }
      }
    },
    "items": {},
    "enemies": {},
    "text": "You enter the hollow through the opening in the trees, and find a small man with a little shop set up in the middle of the moonlight. (\"talk manny\") To the east is the field."
  },
  "platinumMine": {
    "name": "Platinum Mine",
    "neededToEnter": [],
    "neighbors": {
      "west": "forestTrailThree"
    },
    "neededAlliances": [],
    "bannedAlliances": [],
    "availableAlliances": [],
    "npcs": {
      "robot": {
        "name": "Miner Robot",
        "text": "*beep beep* \"Hello there. You are currently in the platinum mine. Platinum is number 78 on the periodic table. It takes more time to find, and is rarer, but is worth 2x more than gold. You can mine it using (\"mine\")\"",
        "wares": {}
      }
    },
    "items": {},
    "enemies": {},
    "text": "You enter a small cave, dimly lit with shining walls. It looks like nobody has been here for some time, but perhaps that's to your advantage. Then you notice a small, metal figure mining slowly and mechanically. (\"talk robot\")"
  }
}